pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
/*
 * Copyright (c) 2019, Pycom Limited.
 *
 * This software is licensed under the GNU GPL version 3 or any
 * later version, with permitted additional terms. For more information
 * see the Pycom Licence v1.0 document supplied with this file, or
 * available at https://www.pycom.io/opensource/licensing
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#include "py/mpstate.h"
#include "py/obj.h"
#include "py/objstr.h"
#include "py/nlr.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "py/stream.h"

#include "netutils.h"

#include "esp_system.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_eth.h"

#include "gpio.h"
#include "machpin.h"
#include "pins.h"
#include "ksz8851conf.h"
#include "ksz8851.h"

#include "modeth.h"
#include "mpexception.h"
#include "lwipsocket.h"
//#include "modmachine.h"
//#include "mperror.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/event_groups.h"
#include "freertos/timers.h"

#include "esp32chipinfo.h"
#include "app_sys_evt.h"

/*****************************************************************************
* DEFINE CONSTANTS
*****************************************************************************/
#define ETHERNET_TASK_STACK_SIZE        3072
#define ETHERNET_TASK_PRIORITY          24 // 12
#define ETHERNET_CHECK_LINK_PERIOD_MS   2000
#define ETHERNET_CMD_QUEUE_SIZE         100

//EVENT bits
#define ETHERNET_EVT_CONNECTED        0x0001
#define ETHERNET_EVT_STARTED          0x0002

//#define DEBUG_MODETH
#define MSG(fmt, ...) printf("[%u] modeth: " fmt, mp_hal_ticks_ms(), ##__VA_ARGS__)
//#define MSG(fmt, ...) (void)0

/*****************************************************************************
* DECLARE PRIVATE FUNCTIONS
*****************************************************************************/
static void TASK_ETHERNET (void *pvParameters);
static mp_obj_t eth_init_helper(eth_obj_t *self, const mp_arg_val_t *args);
static IRAM_ATTR void ksz8851_evt_callback(uint32_t ksz8851_evt);
static void process_tx(uint8_t* buff, uint16_t len);
static uint32_t process_rx(void);
static void eth_validate_hostname (const char *hostname);
static esp_err_t modeth_event_handler(void *ctx, system_event_t *event);

/*****************************************************************************
* DECLARE PRIVATE DATA
*****************************************************************************/
eth_obj_t DRAM_ATTR eth_obj = {
        .mac = {0},
        .hostname = {0},
        .link_status = false,
        .sem = NULL,
        .trigger = 0,
        .events = 0,
        .handler = NULL,
        .handler_arg = NULL
};

static uint8_t* modeth_rxBuff = NULL;
#if defined(FIPY) || defined(GPY)
// Variable saving DNS info
static tcpip_adapter_dns_info_t eth_sta_inf_dns_info;
#endif
uint8_t ethernet_mac[ETH_MAC_SIZE] = {0};
xQueueHandle DRAM_ATTR eth_cmdQueue = NULL;
static DRAM_ATTR EventGroupHandle_t eth_event_group;
static uint16_t num_resets_int_pin = 0;
static uint16_t num_resets_overflow = 0;
static uint16_t num_strange_isr = 0;
static uint16_t num_strange_isr_zero = 0;

/*****************************************************************************
* DEFINE PUBLIC FUNCTIONS
*****************************************************************************/

void eth_pre_init (void) {
    // init tcpip stack
    tcpip_adapter_init();
    // init tcpip eth evt handlers to default
    esp_event_set_default_eth_handlers();
    // register eth app evt handler
    app_sys_register_evt_cb(APP_SYS_EVT_ETH, modeth_event_handler);
    //Create cmd Queue
    eth_cmdQueue = xQueueCreate(ETHERNET_CMD_QUEUE_SIZE, sizeof(modeth_cmd_ctx_t));
    //Create event group
    eth_event_group = xEventGroupCreate();

    // create eth Task
    xTaskCreatePinnedToCore(TASK_ETHERNET, "ethernet_task", ETHERNET_TASK_STACK_SIZE / sizeof(StackType_t), NULL, ETHERNET_TASK_PRIORITY, &ethernetTaskHandle, 1);
}

void modeth_get_mac(uint8_t *mac)
{
    memcpy(mac, ethernet_mac, ETH_MAC_SIZE);
}

eth_speed_mode_t get_eth_link_speed(void)
{
    uint16_t speed = ksz8851_regrd(REG_PORT_STATUS);
    if((speed & (PORT_STAT_SPEED_100MBIT)))
    {
        return ETH_SPEED_MODE_100M;
    }
    else
    {
        return ETH_SPEED_MODE_10M;
    }
}

bool is_eth_link_up(void)
{
    return eth_obj.link_status;
}

/*****************************************************************************
* DEFINE PRIVATE FUNCTIONS
*****************************************************************************/

static esp_err_t modeth_event_handler(void *ctx, system_event_t *event)
{
    tcpip_adapter_ip_info_t ip;

    switch (event->event_id) {
    case SYSTEM_EVENT_ETH_CONNECTED:
        MSG("EH Ethernet Link Up\n");
        break;
    case SYSTEM_EVENT_ETH_DISCONNECTED:
        MSG("EH Ethernet Link Down\n");
        mod_network_deregister_nic(&eth_obj);
        xEventGroupClearBits(eth_event_group, ETHERNET_EVT_CONNECTED);
        break;
    case SYSTEM_EVENT_ETH_START:
        MSG("EH Ethernet Started\n");
        break;
    case SYSTEM_EVENT_ETH_GOT_IP:
        memset(&ip, 0, sizeof(tcpip_adapter_ip_info_t));
        ESP_ERROR_CHECK(tcpip_adapter_get_ip_info(ESP_IF_ETH, &ip));
        MSG("EH Got IP Addr: " IPSTR " " IPSTR " " IPSTR "\n", IP2STR(&ip.ip), IP2STR(&ip.netmask), IP2STR(&ip.gw));
#if defined(FIPY) || defined(GPY)
        MSG("EH save DNS\n");
        // Save DNS info for restoring if wifi inf is usable again after LTE disconnect
        tcpip_adapter_get_dns_info(TCPIP_ADAPTER_IF_ETH, TCPIP_ADAPTER_DNS_MAIN, &eth_sta_inf_dns_info);
#endif
        mod_network_register_nic(&eth_obj);
        xEventGroupSetBits(eth_event_group, ETHERNET_EVT_CONNECTED);
        break;
    case SYSTEM_EVENT_ETH_STOP:
        MSG("EH Ethernet Stopped\n");
        xEventGroupClearBits(eth_event_group, ETHERNET_EVT_STARTED);
        break;
    default:
        break;
    }
    return ESP_OK;
}

static void eth_set_default_inf(void)
{
#if defined(FIPY) || defined(GPY)
    tcpip_adapter_set_dns_info(TCPIP_ADAPTER_IF_ETH, TCPIP_ADAPTER_DNS_MAIN, &eth_sta_inf_dns_info);
    tcpip_adapter_up(TCPIP_ADAPTER_IF_ETH);
#endif
}
static void process_tx(uint8_t* buff, uint16_t len)
{
#ifdef DEBUG_MODETH
    if ( len > 3){
        MSG("process_tx(%u): [%x %x %x %x ... %x %x %x %x]\n", len,
            buff[0], buff[1], buff[2], buff[3],
            buff[len-4], buff[len-3], buff[len-2], buff[len-1]);
    } else {
        MSG("process_tx(%u)\n", len);
    }
#endif
    // disable int before reading buffer
    ksz8851_regwr(REG_INT_MASK, 0);

    if (eth_obj.link_status) {
        ksz8851BeginPacketSend(len);
        ksz8851SendPacketData(buff, len);
        ksz8851EndPacketSend();
    }

