pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);

}
static uint32_t process_rx(void)
{
    uint32_t len, frameCnt;
    uint32_t totalLen = 0;

    // disable int before reading buffer
    ksz8851_regwr(REG_INT_MASK, 0);

    frameCnt = (ksz8851_regrd(REG_RX_FRAME_CNT_THRES) & RX_FRAME_CNT_MASK) >> 8;
    uint32_t frameCntTotal = frameCnt;
    // MSG("TE process_rx f:%u\n", frameCnt);
    while (frameCnt > 0)
    {
        ksz8851RetrievePacketData(modeth_rxBuff, &len, frameCnt);
        if(len)
        {
#ifdef DEBUG_MODETH
            if ( len > 3){
                MSG("process_rx[%u/%u] len=%u: [%x %x %x %x ... %x %x %x %x]\n", c, frameCnt, len,
                    modeth_rxBuff[0], modeth_rxBuff[1], modeth_rxBuff[2], modeth_rxBuff[3],
                    modeth_rxBuff[len-4], modeth_rxBuff[len-3], modeth_rxBuff[len-2], modeth_rxBuff[len-1]
                    );
            } else {
                MSG("process_rx[%u/%u] len=%u\n", frameCnt, frameCntTotal, len);
            }
#endif
            totalLen += len;
            tcpip_adapter_eth_input(modeth_rxBuff, len, NULL);
        } else {
            printf("process_rx[%u/%u] zero len\n", frameCnt, frameCntTotal);
        }
        frameCnt--;
    }
#ifdef DEBUG_MODETH
    //if ( frameCntTotal != 1)
        printf("TE process_rx frameCnt:%u len:%u REENABLEINT\n", frameCnt, totalLen);
#endif

    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);

    return totalLen;
}

static void processInterrupt(void) {
    modeth_cmd_ctx_t ctx;
    ctx.buf = NULL;
    ctx.isr = 0;
    uint16_t processed = 0;

#ifdef DEBUG_MODETH
    // TODO: maybe we should check the queue and not enter the same cmd again? also in ksz8851_evt_callback
    modeth_cmd_ctx_t ctx_peek;
    UBaseType_t queue_len = uxQueueMessagesWaiting(eth_cmdQueue);
    BaseType_t has_peek = xQueuePeek(eth_cmdQueue, &ctx_peek, 0);
    assert( (bool) queue_len == (bool) has_peek );
#endif

    // // disable interrupts
    // // FIXME: should we disable int around reading/clearing? do we need a mutex?
    // ksz8851_regwr(REG_INT_MASK, 0);

    // read interrupt status
    ctx.isr = ksz8851_regrd(REG_INT_STATUS);

    // clear interrupt status
    ksz8851_regwr(REG_INT_STATUS, 0xFFFF);

    // // enable interrupts
    // ksz8851_regwr(REG_INT_MASK, INT_MASK);

    // MSG("processInterrupt 0x%x\n", ctx.isr);

    // FIXME: capture errQUEUE_FULL


    if (ctx.isr & INT_RX) {
        //if (queue_len)
        //    MSG("pI: RX + Q[%u]:{0x%x,...}\n", queue_len, ctx_peek.cmd );
        // else
        //     MSG("pI: RX + Q[%u]\n", queue_len );
        ctx.cmd = ETH_CMD_RX;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_RX_OVERRUN) {
        //if (queue_len)
        //    MSG("pI: RXOVER + Q[%u]:{0x%x,...}\n", queue_len, ctx_peek.cmd );
        // else
        //     MSG("pI: RXOVER + Q[%u]\n", queue_len );
        ctx.cmd = ETH_CMD_OVERRUN;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_PHY) {
        //if (queue_len)
        //    MSG("pI: PHY + Q[%u]:{0x%x,...}\n", queue_len, ctx_peek.cmd );
        // else
        //     MSG("pI: PHY + Q[%u]\n", queue_len );
        ctx.cmd = ETH_CMD_CHK_LINK;
        // TODO: nofify needed?
        // // unblock task if link up
        // if(!eth_obj.link_status)
        // {
        //     xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
        // }
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (processed != 1){
        MSG("processInterrupt 0x%x %u\n", ctx.isr, processed);
    }

    if ( ! processed ) {
        // Normally this shouldn't happen. It migth be possible to happen in this case:
        // interupt fires
        // cmd is put is received via the queue
        // another interupt fires and puts a new cmd into the queue
        // processInterrupt for the first one is exectued, but handles both (all) events
        // later the second cmd is handled but processInterrupt doesn't find anything to do
        // this case shouldn't be a real problem though?!
        ctx.cmd = ETH_CMD_OTHER;
        xQueueSend(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

}


/* callback runs from interrupt context */
static IRAM_ATTR void ksz8851_evt_callback(uint32_t ksz8851_evt)
{
    modeth_cmd_ctx_t ctx;
    ctx.cmd = ETH_CMD_HW_INT;
    ctx.buf = NULL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToFrontFromISR(eth_cmdQueue, &ctx, &xHigherPriorityTaskWoken);
    // seems is needed for link up at the start ... TODO is it actually the best solution to ulTaskNotifyTake() from Task_ETHERNET to wait for link up?
    // xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
}

// void printTaskStatus(){
//     UBaseType_t numTasks = uxTaskGetNumberOfTasks();
//     char* taskStatusWriteBuffer = (char*) heap_caps_malloc(sizeof(char) * 40 * numTasks, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
//     vTaskGetRunTimeStats(taskStatusWriteBuffer);
//     MSG("TE vTaskGetRunTimeStats:\n%s\n", taskStatusWriteBuffer);
//     heap_caps_free(taskStatusWriteBuffer);
// }

static void TASK_ETHERNET (void *pvParameters) {
    MSG("TE\n");

    static uint32_t thread_notification;
    system_event_t evt;
    modeth_cmd_ctx_t queue_entry;
    uint16_t timeout = 0;
    uint16_t max_timeout = 50u; // 5

    // Block task till notification is recieved
    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    MSG("TE tn=%u\n", thread_notification);

    if (thread_notification)
    {
        if(ESP_OK != esp_read_mac(ethernet_mac, ESP_MAC_ETH))
        {
            // Set mac to default
            ethernet_mac[0] = KSZ8851_MAC0;
            ethernet_mac[1] = KSZ8851_MAC1;
            ethernet_mac[2] = KSZ8851_MAC2;
            ethernet_mac[3] = KSZ8851_MAC3;
            ethernet_mac[4] = KSZ8851_MAC4;
            ethernet_mac[5] = KSZ8851_MAC5;
        }
        else
        {
            // check for MAC address limitation of KSZ8851 (5th Byte should not be 0x06)
            if(ethernet_mac[4] == 0x06)
            {
                // OR this byte with last byte
                ethernet_mac[4] |= (ethernet_mac[5] | 0x01 /*Just in case if last byte = 0*/ );
            }
        }
        //save mac
        memcpy(eth_obj.mac, ethernet_mac, ETH_MAC_SIZE);

        //Init spi
        ksz8851SpiInit();
        /* link status  */
        ksz8851RegisterEvtCb(ksz8851_evt_callback);
eth_start:
        MSG("TE eth_start\n");
        xQueueReset(eth_cmdQueue);
        xEventGroupWaitBits(eth_event_group, ETHERNET_EVT_STARTED, false, true, portMAX_DELAY);
        MSG("TE init driver\n");
        // Init Driver
        ksz8851Init();

        evt.event_id = SYSTEM_EVENT_ETH_START;
        esp_event_send(&evt);

